//===========================================================================
//文件名称：adc.h
//功能概要：adc底层驱动构件头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2013-5-5   
//===========================================================================

#ifndef _ADC_H           //防止重复定义（ 开头）
#define _ADC_H

#include "common.h"    //包含公共要素头文件

//用于定义采样次数
#define SAMPLE4   0
#define SAMPLE8   1
#define SAMPLE16  2
#define SAMPLE32  3
//定义输入模式
#define SINGLE_END     0   //单端输入
#define DIFFERENTIAL   1   //差分输入
//通道选择
#define MUXSEL_A     0	//选择端口的A通道
#define MUXSEL_B	 1	//选择端口的B通道
#define CHANNELA  ADC_CFG2_MUXSEL_MASK

//===========================================================================
//函数名称：adc_init
//功能概要：初始化adc模块                                                
//参数说明：chnGroup通道选择配置：A通道MUXSEL_A，B通道MUXSEL_B
//         diff配置模式：单端输入SINGLE_END, 差分输入DIFFERENTIAL
//         accurary采样精度:单端8-12-10-16；差分9-13-11-16
//         HardwareAverage硬件滤波：sample4/sample8/sample16/sample32
//===========================================================================
void adc_init(uint_8 chnGroup,uint_8 diff,uint_8 accurary,uint_8 HDAve);

//===========================================================================
//函数名称：adc_read
//功能概要：初始化adc模块                                                
//参数说明：channel：单端输入 通道范围 0~ 23
//               差分输入通道范围 0~ 3
//===========================================================================
uint_16 adc_read(uint_8 channel);  //int-->uint_8

//===========================================================================
//函数名称：adc_cal
//功能概要：adc模块校正功能函数    
//说明：在校正之前，须正确配置ADC时钟、采样时间、模式、硬件滤波32次等，详见KL25芯片手册28.4.6
//============================================================================
uint_8 adc_cal();


//adc_mid:1路A/D转换函数(中值滤波)-------------------------------------------------
//功能:获取通道channel中值滤波后的A/D转换结果
//参数:channel = 通道号
//返回:该通道中值滤波后的A/D转换结果
//内部调用:ADCValue
//----------------------------------------------------------------------------
uint_16 adc_mid(uint_8 channel);

//adc_ave:1路A/D转换函数(均值滤波)------------------------------------------------
//功能:通道channel进行n次中值滤波,求和再作均值,得出均值滤波结果
//参数:channel = 通道号,n = 中值滤波次数
//返回:该通道均值滤波后的A/D转换结果
//内部调用:adc_mid
//---------------------------------------------------------------------------
uint_16 adc_ave(uint_8 channel, uint_8 n);


#endif

//===========================================================================
//声明：
//（1）我们开发的源代码，在本中心提供的硬件系统测试通过，真诚奉献给社会，不足之处，
//     欢迎指正。
//（2）对于使用非本中心硬件系统的用户，移植代码时，请仔细根据自己的硬件匹配。
//
//苏州大学飞思卡尔嵌入式中心（苏州华祥信息科技有限公司）
//技术咨询：0512-65214835  http://sumcu.suda.edu.cn
//业务咨询：0512-87661670,18915522016  http://www.hxtek.com.cn
