//===========================================================================
//文件名称：isr.h（中断底层驱动构件头文件）
//功能概要： 声明用户ISR
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//更新记录：2012-11-12   V1.0
//===========================================================================

#ifndef ISR_H_
#define ISR_H_


// 注册自定义中断服务例程

//===========================================================================
//函数名称：isr_uart0_re
//参数说明：user_isr_ptr：用户自定义参数
//功能概要：UART_0(串口0)中断服务例程
//===========================================================================
void isr_uart0_re(pointer user_isr_ptr);

//===========================================================================
//ISR 名称：isr_gpio_cd,PTC、PTD端口中断服务例程
//参数说明：user_isr_ptr：用户自定义参数，此处未用
//功能概要：每接收到一帧64个字节的RF数据，产生一次本中断。
//         本例程对收到的数据，按照RF_ReceiveFrame函数对数据进行接收
//         组帧。接收成功后，置lwevent_group事件组的EVENT_RF_RECV事件
//         位（在"01_app_include.h"文件中声明的）。
//===========================================================================
void isr_gpio_cd(pointer user_isr_ptr);



#endif
