//===========================================================================
//文件名称：task_light.c
//功能概要：控制运行指示灯闪烁
//版权所有：苏州大学嵌入式中心(sumcu.suda.edu.cn)
//版本更新：根据需要更新
//备    注：20151201，WYH
//===========================================================================
#include "01_app_include.h"    //应用任务公共头文件

//===========================================================================
//任务名称：task_light
//功能概要：控制运行指示灯闪烁，该任务优先级为14，仅高于task_adc
//参数说明：未使用
//===========================================================================
void task_light(uint_32 initial)
{	
    //进入任务循环体
    while(TRUE) 
    {
        //以下加入用户程序---------------------------------------------------
        
        //（1）控制运行指示灯闪烁
        light_change(LIGHT_RUN_1);      
        //（2）任务延时200滴答，每个滴答（tick）对应5ms，延时200*5ms=1s
	    _time_delay_ticks(200);
	
     } //任务循环体end_while
}
